<?php !defined('IN WEB') AND exit('Access Denied!');

class Config_Push{
	public static $msg = array(
	  					'1'=> "中秋好礼，免费金币，全新版本，火爆开启！",
	  					'2'=> "您的对手{mnick}投降了！恭喜您获得胜利！",
						'3'=> "您的对手{mnick}向您求和，放不放TA一马？",
						'4'=> "您的对手{mnick}同意了您的和棋请求!平局。",
						'5'=> "您的对手{mnick}拒绝您的和棋请求，游戏继续。",
						'6'=> "您的对手{mnick}提醒您下棋 ",
	  					'7'=> "您的对手{mnick}向您约战！请打败TA！",
	  					'8'=> "您的好友{mnick}已经建好了棋局在等您，来对弈一局?",
	  					'9'=> "亲，多天都没动轮你下的棋局了，5天不走棋，就判你输哦~",
	  					'9'=> "您的棋局已经很久没走了,一段时间不走自动判输哦",
	 					'10'=> "您的好友为你创建了一局棋局，快去对战吧！",
	 					'11'=> "您的对手{mnick}绝杀结束了一局棋！上去看看哦",

	  );
	  
}