<?php !defined('IN WEB') AND exit('Access Denied!');
class Config_Slots{
	
	public static $enterMinMoney = 20000;//进入最低金币数
	
	public static $switch = 1;//开关

	public static $odds = array
	(
		//牌型=》赔率
		106=>30,//五小牛
		105=>20,//五花牛
		103=>10,//炸弹牛
		10 =>5,
		9  =>3,
		8  =>3,
		7  =>1,
		6  =>1,
		5  =>1,
		4  =>0.5,
		3  =>0.5,
		2  =>0.5,
		1  =>0.5,
		0  =>0.2,
	);
	
	public static  $cardType2Name = array
	(
		106=>'五小牛',
		105=>'五花牛',
		103=>'炸弹牛',
		10 =>'牛牛',
		9  =>'牛九',
		8  =>'牛八',
		7  =>'牛七',
		6  =>'牛六',
		5  =>'牛五',
		4  =>'牛四',
		3  =>'牛三',
		2  =>'牛二',
		1  =>'牛丁',
		0  =>'没牛',
	);
	
	
	public static $changeCardCosts = array
	(
		1=>1.5,//第一次换牌扣费比例
		2=>1,//第二次换牌扣费比例
		3=>0.5//第三次换牌扣费比例
	);
	
	/*
	 * //牌型=》出现概率
				106=>0,
				105=>0,
				103=>0,
				10 =>0,
				9  =>0,
				8  =>0,
				7  =>10,
				6  =>10,
				5  =>10,
				4  =>20,
				3  =>20,
				2  =>10,
				1  =>10,
				0  =>10,
	 */
	public static $startGamesProbability = array
	(
	
		//正常换牌概率  根据下注的金币数
		'normal'=>
			array(
				106=>0,
				105=>0,
				103=>0,
				10 =>0,
				9  =>0,
				8  =>0,
				7  =>10,
				6  =>5,
				5  =>5,
				4  =>30,
				3  =>20,
				2  =>10,
				1  =>10,
				0  =>10,
			),
			
		//系统输金币
		'systemlost'=>
			array(
				106=>0,
				105=>0,
				103=>0,
				10 =>0,
				9  =>0,
				8  =>0,
				7  =>0,
				6  =>0,
				5  =>0,
				4  =>20,
				3  =>10,
				2  =>10,
				1  =>20,
				0  =>40,
			),	
		//赢金币换牌概率  根据赢的金币数	
		'win'=>
			array(
				5000000=>array
				(
					106=>0,
					105=>0,
					103=>0,
					10=>0,
					9=>0,
					8=>0,
					7=>0,
					6=>0,
					5=>20,
					4=>20,
					3=>20,
					2=>20,
					1=>10,
					0=>10,
				),
				1000000000=>array
				(
					106=>0,
					105=>0,
					103=>0,
					10=>0,
					9=>0,
					8=>0,
					7=>0,
					6=>0,
					5=>0,
					4=>20,
					3=>20,
					2=>20,
					1=>20,
					0=>20,
				),
			),	
		
		//输金币换牌概率  根据输的金币数	输得越大 换大牌的概率越高
		'lost'=>
			array(
				10000000=>array
				(
					106=>0,
					105=>0,
					103=>0,
					10=>0,
					9=>10,
					8=>5,
					7=>10,
					6=>20,
					5=>20,
					4=>10,
					3=>10,
					2=>5,
					1=>5,
					0=>5,
				),
				10000000000000=>array
				(
					106=>0,
					105=>0,
					103=>0,
					10=>5,
					9=>25,
					8=>25,
					7=>10,
					6=>15,
					5=>10,
					4=>5,
					3=>5,
					2=>0,
					1=>0,
					0=>0,
				),
			),	
	);
	
	
	public static $changeCardProbability = array
	(
		//正常换牌概率  根据下注的金币数
		'normal'=>
			array(
				500000=>array('>'=>55,    '='=>25, '<'=>20),
				2000000=>array('>'=>50,   '='=>20, '<'=>30),
				1000000000=>array('>'=>40,'='=>10,'<'=>50),
			),
		//赢金币换牌概率  根据赢的金币数	
		'win'=>
			array(
				5000000=>array('>'=>10,   '='=>20, '<'=>70),//200000-300000
				1000000000=>array('>'=>0,'='=>10,'<'=>90),//500000
			),	
		
		//输金币换牌概率  根据输的金币数	输得越大 换大牌的概率越高
		'lost'=>
			array(
				8000000=>array('>'=>50,   '='=>20, '<'=>30),
				1000000000=>array('>'=>70,'='=>20,'<'=>10),//500000
			)
		
	);

}