<?php !defined('IN WEB') AND exit('Access Denied!');
class Monitor_Config {

	public static $statusConfig = array(
										'1'  =>'发送成功',
										'101'=>'无此用户',
										'102'=>'密码错',
										'103'=>'提交过快',
										'104'=>'系统忙',
										'105'=>'敏感短信',
										'106'=>'消息长度错',
										'107'=>'包含错误的手机号码',
										'108'=>'手机号码个数错',
										'109'=>'无发送额度',
										'110'=>'不在发送时间内',
										'111'=>'超出该账户当月发送额度限制',
										'112'=>'用户没有订购该产品',
										'113'=>'extno格式错',
										);

}